## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_cloudfront_function.web_uri_rewriter will be destroyed
  # (because aws_cloudfront_function.web_uri_rewriter is not in configuration)
-   resource "aws_cloudfront_function" "web_uri_rewriter" {
-       arn             = "arn:aws:cloudfront::357150818708:function/cpfreporter-web_uri_rewriter" -> null
-       code            = <<-EOT
            function handler(event) {
                var request = event.request;
                var uri = request.uri;
            
                if (uri === '') {
                    request.uri = 'index.html'
                } else if (uri.endsWith('/')) {
                    request.uri += 'index.html';
                } else if (!uri.includes('.')) {
                    request.uri += '/index.html';
                }
            
                return request;
            }
        EOT -> null
-       comment         = "Rewrites URIs to be SPA-friendly." -> null
-       etag            = "ETVPDKIKX0DER" -> null
-       id              = "cpfreporter-web_uri_rewriter" -> null
-       live_stage_etag = "ETVPDKIKX0DER" -> null
-       name            = "cpfreporter-web_uri_rewriter" -> null
-       publish         = true -> null
-       runtime         = "cloudfront-js-1.0" -> null
-       status          = "UNASSOCIATED" -> null
    }

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:17" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:17" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 17 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "fbc5e47504b58d94b686c1d8df88fd11-6" -> "d1530f86ca61c86a26fa654c0a46f7e8"
        id                     = "graphql.d1530f86ca61c86a26fa654c0a46f7e8.zip"
        tags                   = {}
      ~ version_id             = "gM3E1o8SkZK_9JodCh9alFNY6RSNto89" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "4ec39a1802ad471c9281759bd4d36065" -> "1310e8797d11fa22899d647f10403899"
        id                     = "dist/200.html"
      ~ source_hash            = "4ec39a1802ad471c9281759bd4d36065" -> "1310e8797d11fa22899d647f10403899"
        tags                   = {}
      ~ version_id             = "_baMlvstTyi2XQweXn78s7PQM9wijQRJ" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "ed052c866c3987b7c121febf9a40473f" -> "8f5c9178fa80f14d15cd3a32f819dbee"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "ed052c866c3987b7c121febf9a40473f" -> "8f5c9178fa80f14d15cd3a32f819dbee"
        tags                   = {}
      ~ version_id             = "Zr9Nmlcx7IjSo280o1uLRHxLZmPqgZXk" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "3eea0142653e5f3f036aea89f80d9e97" -> "54f38202789932549d203cfac8d15867"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "3eea0142653e5f3f036aea89f80d9e97" -> "54f38202789932549d203cfac8d15867"
        tags                   = {}
      ~ version_id             = "GAWw7obC_59atTMF33It48aIluklWW7S" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "4ec39a1802ad471c9281759bd4d36065" -> "1310e8797d11fa22899d647f10403899"
        id                     = "dist/index.html"
      ~ source_hash            = "4ec39a1802ad471c9281759bd4d36065" -> "1310e8797d11fa22899d647f10403899"
        tags                   = {}
      ~ version_id             = "eTUky2YyF4UsUz7U9PHKdwf6b7rCuYrg" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.74432613.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "dd42626cf22d4c58fc5e205928b29a40"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.74432613.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.74432613.js"
+       source_hash            = "dd42626cf22d4c58fc5e205928b29a40"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.74432613.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "8d0c60a3ca38489c1bb3fd646469d4db"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.74432613.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.74432613.js.LICENSE.txt"
+       source_hash            = "8d0c60a3ca38489c1bb3fd646469d4db"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.fddc8506.js"] will be destroyed
  # (because key ["static/js/app.fddc8506.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "95df2fdec669243ddc052c67331c2479" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.fddc8506.js" -> null
-       key                    = "dist/static/js/app.fddc8506.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.fddc8506.js" -> null
-       source_hash            = "95df2fdec669243ddc052c67331c2479" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "HWe661EYZClsS9MZmKUvjFZwcD9d58.p" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.fddc8506.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.fddc8506.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "8d0c60a3ca38489c1bb3fd646469d4db" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.fddc8506.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.fddc8506.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.fddc8506.js.LICENSE.txt" -> null
-       source_hash            = "8d0c60a3ca38489c1bb3fd646469d4db" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "I1kGO2sWO9jRT1y7sLGgfYQqxsb8QDd8" -> null
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:33" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:33/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "33" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "0fdfb6ab87ebda250ffa0c9d14938b1e0ae3d011" -> "11dd01ece32978bafe979d3ff982b1c84ffc3943"
              ~ "DD_TAGS"                            = "git.commit.sha:0fdfb6ab87ebda250ffa0c9d14938b1e0ae3d011,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:11dd01ece32978bafe979d3ff982b1c84ffc3943,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "0fdfb6ab87ebda250ffa0c9d14938b1e0ae3d011" -> "11dd01ece32978bafe979d3ff982b1c84ffc3943"
                # (15 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "33" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 4 to add, 7 to change, 5 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7185602045)*